CSI API ETABS v1
cPropFrameSDShape.GetReinfCorner Method
 Retrieves corner point reinforcing data for solid rectangle, circle and polygon shapes in a section designer property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetReinfCorner(
	string Name,
	string ShapeName,
	ref int NumberItems,
	ref int[] PointNum,
	ref string[] RebarSize
)
Function GetReinfCorner (
	Name As String,
	ShapeName As String,
	ByRef NumberItems As Integer,
	ByRef PointNum As Integer(),
	ByRef RebarSize As String()
) As Integer
Dim instance As cPropFrameSDShape
Dim Name As String
Dim ShapeName As String
Dim NumberItems As Integer
Dim PointNum As Integer()
Dim RebarSize As String()
Dim returnValue As Integer
returnValue = instance.GetReinfCorner(Name,
	ShapeName, NumberItems, PointNum,
	RebarSize)
int GetReinfCorner(
	String^ Name,
	String^ ShapeName,
	int% NumberItems,
	array<int>^% PointNum,
	array<String^>^% RebarSize
)
abstract GetReinfCorner :
        Name : string *
        ShapeName : string *
        NumberItems : int byref *
        PointNum : int[] byref *
        RebarSize : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property that is a section designer section
ShapeName
Type: System.String
 The name of an existing solid rectangle shape in the specified frame section property
NumberItems
Type: System.Int32
 The number of edges in the shape
PointNum
Type: System.Int32[]
 This is an array that includes the corner point number in the shape
RebarSize
Type: System.String[]
 This is an array that includes None or the name of a defined rebar, indicating the rebar assignment to the considered corner point
Return Value
Type: Int32
 Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cPropFrameSDShape Interface
ETABSv1 Namespace